.config/emacs/config.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes 

* Introduction

I have the time to configure Emacs to my liking. This is my config. 

* Table of Contents
:PROPERTIES:
:TOC:      :include all
:END:


:CONTENTS:
- [[#introduction][Introduction]]
- [[#table-of-contents][Table of Contents]]
- [[#faster-startup][Faster Startup]]
- [[#default-settings][Default Settings]]
- [[#package-management][Package Management]]
  - [[#straight-el][Straight El]]
  - [[#guix][GUIX]]
    - [[#general][General]]
    - [[#guix-packages][guix packages]]
- [[#completions][Completions]]
  - [[#vertico][Vertico]]
  - [[#company][Company]]
- [[#ui][UI]]
  - [[#modeline][Modeline]]
  - [[#dashboard][Dashboard]]
  - [[#window][Window]]
    - [[#scaling-text][Scaling text]]
    - [[#remembering-window-history][Remembering window history]]
    - [[#doom-window-keybindings][Doom Window Keybindings]]
    - [[#transparency][Transparency]]
- [[#editor][Editor]]
  - [[#keybindings][Keybindings]]
    - [[#evil-mode][Evil Mode]]
    - [[#evil-tutor][Evil Tutor]]
    - [[#key-chord][Key-Chord]]
    - [[#which-key][Which Key]]
    - [[#multi-cursors][multi-cursors]]
      - [[#guix-packages][guix packages]]
    - [[#evil-org][evil org]]
    - [[#easy-text-in-and-out][Easy text In and Out]]
  - [[#doom-snippets][Doom Snippets]]
  - [[#file-templates][File Templates]]
- [[#lang][Lang]]
  - [[#sh][sh]]
  - [[#python][Python]]
  - [[#cc][CC]]
    - [[#clang-format][clang-format]]
  - [[#go][Go]]
  - [[#yasnippet][Yasnippet]]
  - [[#commenting][Commenting]]
  - [[#flyspell][Flyspell]]
  - [[#org][Org]]
    - [[#org-babel][Org Babel]]
    - [[#org-rice][Org Rice]]
      - [[#better-font-faces][Better Font faces]]
      - [[#center-the-org-buffer][Center the Org Buffer]]
      - [[#foo][foo]]
    - [[#org-roam][Org Roam]]
    - [[#org-agenda][Org Agenda]]
      - [[#update-contents-on-save][Update Contents on Save]]
      - [[#rainbow-delimiters][Rainbow Delimiters]]
    - [[#pomodoro][Pomodoro]]
  - [[#latex][Latex]]
    - [[#balance-window-margins][Balance window margins]]
    - [[#foldingunfolding-like-0rg-mode][folding/unfolding like 0rg-mode]]
    - [[#auctex][Auctex]]
  - [[#ledger][Ledger]]
  - [[#emacs-haskell][Emacs-Haskell]]
- [[#emacs][Emacs]]
  - [[#dired][Dired]]
    - [[#file-icons][File Icons]]
    - [[#hide-dotfiles][Hide Dotfiles]]
  - [[#clean-folders][Clean folders]]
  - [[#emacs-client][Emacs client]]
  - [[#info][Info]]
- [[#term][Term]]
  - [[#eshell][eshell]]
  - [[#vterm][vterm]]
- [[#tools][Tools]]
  - [[#projectile][Projectile]]
  - [[#counsel-projectile][Counsel Projectile]]
  - [[#magit][Magit]]
  - [[#lsp][LSP]]
  - [[#pdf][PDF]]
    - [[#guix-packages][GUIX packages]]
  - [[#epub][Epub]]
  - [[#web][Web]]
  - [[#pass][Pass]]
- [[#app][app]]
  - [[#elfeed][Elfeed]]
    - [[#elfeed-tube][Elfeed Tube]]
    - [[#elfeed-rss][Elfeed RSS]]
      - [[#guix-packages][guix packages]]
  - [[#twittering-mode][Twittering Mode]]
  - [[#discord][Discord]]
  - [[#leetcode][Leetcode]]
- [[#tramp][Tramp]]
- [[#spellcheck][Spellcheck]]
  - [[#grammar][Grammar]]
  - [[#spelling][Spelling]]
:END:

* Faster Startup 

#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 100 1024 1024)) ;; 100 MB
  (setq read-process-output-max (* 1 1024 1024)) ;; 1 MB
#+end_src

* Default Settings

#+begin_src emacs-lisp
       ;; The default is 800 kilobytes.  Measured in bytes.
       (setq inhibit-startup-message t)

       (scroll-bar-mode -1)        ; Disable visible scrollbar
       (tool-bar-mode -1)          ; Disable the toolbar
       (tooltip-mode -1)           ; Disable tooltips
       (set-fringe-mode 10)        ; Give some breathing room

       (menu-bar-mode -1)            ; Disable the menu bar

       ;; Set up the visible bell
       (setq visible-bell t)

       (set-fringe-mode 10)        ; Give some breathing room

       (recentf-mode 1) ;; remembers recently edited files

       ;; Save what you enter into minibuffer prompts
       (setq history-length 25)
       (savehist-mode 1)

       ;; Remember and restore the last cursor location of opened files
       (save-place-mode 1)

       ;; Move customization variables to a separate file and load it
       (setq custom-file (locate-user-emacs-file "custom-vars.el"))
       (load custom-file 'noerror 'nomessage)

       ;; Don't pop up UI dialogs when prompting
       (setq use-dialog-box nil)

       ;; Revert buffers when the underlying file has changed
       (global-auto-revert-mode 1)
       ;; Revert Dired and other buffers
       (setq global-auto-revert-non-file-buffers t)
       ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
       ;;       in Emacs and init.el will be generated automatically!

       ;; You will most likely need to adjust this font size for your system!
       (defvar efs/default-font-size 120)
       (defvar efs/default-variable-font-size 120)

#+end_src

* Package Management
** Straight El
  #+begin_src emacs-lisp
        (defvar bootstrap-version)
        (let ((bootstrap-file
                (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
                (bootstrap-version 5))
            (unless (file-exists-p bootstrap-file)
            (with-current-buffer
                (url-retrieve-synchronously
                    "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
                    'silent 'inhibit-cookies)
                (goto-char (point-max))
                (eval-print-last-sexp)))
            (load bootstrap-file nil 'nomessage))

    ;; Use straight.el for use-package expressions
    (straight-use-package 'use-package)
    (setq use-package-always-ensure nil)
    ;; Load the helper package for commands like `straight-x-clean-unused-repos'
    (require 'straight-x)
#+end_src

** GUIX 

#+begin_src emacs-lisp
(use-package guix-emacs
   :straight nil)
#+end_src

***  General 
#+begin_src emacs-lisp
  (use-package general
    :straight nil
    :config
    (general-evil-setup t)

    (general-create-definer rune/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

  (rune/leader-keys
    "cc" 'compile
    "." 'find-file
    "," 'ido-switch-buffer
    "oa" 'org-agenda
    "oe" 'eshell
    "ov" 'vterm
    "hrr" '((lambda () (interactive) (load-file "~/.config/emacs/init.el"))
            :which-key "Reload Emacs config")
    "fr" '(recentf-open-files :which-key "Recent files")
    "fp" '((lambda () (interactive) (find-file (expand-file-name "~/.config/emacs/config.org")))
           :which-key "edit config")
    "fP" '(find-file "~/.config/emacs" :which-key "edit config") ; doom emacs config dir
    "<" 'list-buffers) 

  (rune/leader-keys
    "G"  '(:ignore t :which-key "Guix")
    "Gg" '(guix :which-key "Guix")
    "Gi" '(guix-installed-user-packages :which-key "user packages")
    "GI" '(guix-installed-system-packages :which-key "system packages")
    "Gp" '(guix-packages-by-name :which-key "search packages")
    "GP" '(guix-pull :which-key "pull"))
#+end_src

*** guix packages
#+begin_src scheme
emacs-guix
#+end_src

* Completions

** Vertico
#+begin_src emacs-lisp
  (use-package vertico
    :straight nil
    :bind (:map vertico-map
           ("C-j" . vertico-next)
           ("C-k" . vertico-previous)
           ("C-f" . vertico-exit)
           :map minibuffer-local-map
           ("C-w" . backward-kill-word))
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))

(use-package orderless
  :straight t
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src


** Company
#+begin_src emacs-lisp
    (use-package company
      :straight t
      :after lsp-mode
      :hook (lsp-mode . company-mode)
      :bind (:map company-active-map
                  ("<tab>" . company-complete-selection))
      (:map lsp-mode-map
            ("<tab>" . company-indent-or-complete-common))
      :custom
      (company-minimum-prefix-length 1)
      (company-idle-delay 0.0))

    (use-package company-box
      :straight t
      :hook (company-mode . company-box-mode))

    (use-package company-prescient
      :straight t
      :after company
      :config
      (company-prescient-mode 1)
      (prescient-persist-mode))

    (add-hook 'after-init-hook 'global-company-mode)

   (setq ispell-program-name "hunspell")
    ;; you could set `ispell-dictionary` instead but `ispell-local-dictionary' has higher priority
    (setq ispell-local-dictionary "en_US")
    (setq ispell-local-dictionary-alist '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US,en_US-med") nil utf-8)))
    ;; new variable `ispell-hunspell-dictionary-alist' is defined in Emacs
    ;; If it's nil, Emacs tries to automatically set up the dictionaries.
    (when (boundp 'ispell-hunspell-dictionary-alist)
      (setq ispell-hunspell-dictionary-alist ispell-local-dictionary-alist))  
  
    (defun my-text-mode-hook ()
    (setq-local company-backends
                '((company-dabbrev company-ispell :separate)
                  company-files)))

  (add-hook 'text-mode-hook #'my-text-mode-hook)
#+end_src

* UI 

** Modeline
#+begin_src emacs-lisp
  (use-package all-the-icons
    :straight nil)

  (use-package doom-modeline
    :straight nil
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
#+end_src


