.config/emacs/init.el

;; Or if you use use-package
(use-package dashboard
  :straight t
  :config
  (dashboard-setup-startup-hook))

(setq dashboard-startup-banner "~/.config/screenshots/example.png")

(column-number-mode)
(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                vterm-mode-hook
                twittering-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package default-text-scale
  :defer 1
  :config
  (default-text-scale-mode))

(use-package winner
  :after evil
  :config
  (winner-mode))

(rune/leader-keys
        "w"  '(:ignore t :which-key "evil window")
        "ws" 'evil-window-split
        "wv" 'evil-window-vsplit
        "ww" 'evil-window-next
        "wo" 'delete-other-windows
        "wq" 'evil-quit
        "wu" 'winner-undo ;; pop in and out of window history
        "wU" 'winner-redo ;; pop in and out of window history
)

;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
  ;;(set-frame-parameter (selected-frame) 'alpha <both>)
  (set-frame-parameter (selected-frame) 'alpha '(85 . 50))
  (add-to-list 'default-frame-alist '(alpha . (85 . 50)))
 ;; Set frame transparency

(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter
     nil 'alpha
     (if (eql (cond ((numberp alpha) alpha)
                    ((numberp (cdr alpha)) (cdr alpha))
                    ;; Also handle undocumented (<active> <inactive>) form.
                    ((numberp (cadr alpha)) (cadr alpha)))
              100)
         '(85 . 50) '(100 . 100)))))

    (rune/leader-keys
        "ct" 'toggle-transparency)

(use-package undo-tree
  :straight nil
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :straight nil
  :init
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1))

(use-package evil-collection
  :straight nil
  :after evil
  :config
  (evil-collection-init))

(use-package evil-tutor
  :straight t)

(use-package key-chord
  :straight nil
  :config 
  (setq key-chord-two-keys-delay 0.5)
  (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
  (key-chord-mode 1))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package evil-multiedit
  :straight nil
  :config 
  (evil-multiedit-default-keybinds))

(use-package evil-org
  :straight t
  :after org
  :hook ((org-mode . evil-org-mode)

         (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(rune/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(use-package doom-snippets
  :straight nil
  :after yasnippet)

(use-package flymake-shellcheck
  :straight nil
  :commands flymake-shellcheck-load
  :init
  (add-hook 'sh-mode-hook 'flymake-shellcheck-load))

(defun my/autoinsert-yas-expand()
  "Replace text in yasnippet template."
  (yas/expand-snippet (buffer-string) (point-min) (point-max)))

(custom-set-variables
 '(auto-insert 'other)
 '(auto-insert-directory "~/Templates/")
 '(auto-insert-alist '((("\\.sh\\'" . "Shell script") . ["template.sh" my/autoinsert-yas-expand])
                       (("\\.el\\'" . "Emacs Lisp") . ["template.el" my/autoinsert-yas-expand])
                       (("\\.py\\'" . "Python script") . ["template.py" my/autoinsert-yas-expand])
                       (("[mM]akefile\\'" . "Makefile") . ["Makefile" my/autoinsert-yas-expand])
                       )))

(use-package flymake-shellcheck
  :straight t
  :commands flymake-shellcheck-load
  :init
  (add-hook 'sh-mode-hook 'flymake-shellcheck-load))

(use-package pyvenv
  :straight nil
  :init
  (setenv "WORKON_HOME" "~/.venvs/")
  :config
  ;; (pyvenv-mode t)

  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))

(setq python-shell-interpreter "python3")
(use-package blacken
  :straight t
  :init
  (setq-default blacken-fast-unsafe t)
  (setq-default blacken-line-length 80)
  )
(use-package python-mode
  :straight t
  :hook
  (python-mode . pyvenv-mode)
  (python-mode . flycheck-mode)
  (python-mode . flymake-mode)
  (python-mode . company-mode)
  (python-mode . blacken-mode)
  (python-mode . yas-minor-mode)
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  (python-shell-interpreter "python3")
  :config
  )

(use-package pyvenv
  :config
  (pyvenv-mode 1))

(use-package ccls
  :straight t
  :hook ((c-mode c++-mode objc-mode cuda-mode) .
         (lambda () (require 'ccls) (lsp)))
  (c-mode . flycheck-mode)
  (c-mode . flymake-mode)
  (c-mode . yas-minor-mode)
  (c-mode . company-mode)
  (c++-mode . flycheck-mode)
  (c++-mode . yas-minor-mode)
  (c++-mode . company-mode))

(use-package clang-format
  :straight t
  :config
  (setq clang-format-style-option "google"))

(global-set-key [C-M-tab] 'clang-format-region)

(use-package go-mode
  :straight t
  :hook
  (go-mode . lsp-deferred)
  (go-mode . flycheck-mode)
  (go-mode . company-mode))

(add-hook 'go-mode-hook
          (lambda ()
            (add-hook 'before-save-hook 'gofmt-before-save)
            (setq tab-width 4)
            (setq indent-tabs-mode 1)))

(add-hook 'go-mode-hook (lambda ()
                          (local-set-key (kbd "C-c C-r") 'go-remove-unused-imports)))

(use-package yasnippet-snippets
  :straight t)
(use-package yasnippet
  :straight nil
  :diminish yas-minor-mode
  :config
  (yas-reload-all)
  (yas-global-mode))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package flycheck
  :straight nil
  :diminish flycheck-mode
  :init
  (setq flycheck-check-syntax-automatically '(save new-line)
        flycheck-idle-change-delay 5.0
        flycheck-display-errors-delay 0.9
        flycheck-highlighting-mode 'symbols
        flycheck-indication-mode 'left-fringe
        flycheck-standard-error-navigation t
        flycheck-deferred-syntax-check nil)
  )
