.config/emacs/config.org
**** foo
#+begin_src emacs-lisp

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org :straight (:type built-in)
    :commands (org-capture org-agenda)
    :hook (org-mode . efs/org-mode-setup)
    (org-mode . flyspell-mode)
    :config

    (setq org-directory "~/Projects/Code/OrgFiles")
    (setq org-agenda-files '("Tasks.org" "Birthdays.org"))


    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))
    ;; Configure custom agenda views
    (setq org-tag-alist
          '((:startgroup)
                                          ; Put mutually exclusive tags here
            (:endgroup)
            ("@errand" . ?E)
            ("@home" . ?H)
            ("@work" . ?W)
            ("agenda" . ?a)
            ("planning" . ?p)
            ("publish" . ?P)
            ("batch" . ?b)
            ("note" . ?n)
            ("idea" . ?i)))

    (setq org-agenda-custom-commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 7)))
              (todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))
              (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

            ("n" "Next Tasks"
             ((todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))))

            ("W" "Work Tasks" tags-todo "+work-email")

            ;; Low-effort next actions
            ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
             ((org-agenda-overriding-header "Low Effort Tasks")
              (org-agenda-max-todos 20)
              (org-agenda-files org-agenda-files)))

            ("w" "Workflow Status"
             ((todo "WAIT"
                    ((org-agenda-overriding-header "Waiting on External")
                     (org-agenda-files org-agenda-files)))
              (todo "REVIEW"
                    ((org-agenda-overriding-header "In Review")
                     (org-agenda-files org-agenda-files)))
              (todo "PLAN"
                    ((org-agenda-overriding-header "In Planning")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "BACKLOG"
                    ((org-agenda-overriding-header "Project Backlog")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "READY"
                    ((org-agenda-overriding-header "Ready for Work")
                     (org-agenda-files org-agenda-files)))
              (todo "ACTIVE"
                    ((org-agenda-overriding-header "Active Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "COMPLETED"
                    ((org-agenda-overriding-header "Completed Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "CANC"
                    ((org-agenda-overriding-header "Cancelled Projects")
                     (org-agenda-files org-agenda-files)))))))
    (setq org-ellipsis " ▾")

    (setq org-capture-templates
          `(("t" "Tasks / Projects")
            ("tt" "Task" entry (file+olp "~/Projects/Code/OrgFiles/Tasks.org" "Inbox")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

            ("j" "Journal Entries")
            ("jj" "Journal" entry
             (file+olp+datetree "~/Projects/Code/OrgFiles/Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)
            ("jm" "Meeting" entry
             (file+olp+datetree "~/Projects/Code/OrgFiles/Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

            ("w" "Workflows")
            ("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/OrgFiles/Journal.org")
             "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

            ("m" "Metrics Capture")
            ("mw" "Weight" table-line (file+headline "~/Projects/Code/OrgFiles/Metrics.org" "Weight")
             "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

                                          ;     (efs/org-font-setup)
    )
#+end_src

*** Org Roam
#+begin_src emacs-lisp
  (use-package org-roam
    :straight nil
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/RoamNotes")
    (org-roam-completion-everywhere t)
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i"    . completion-at-point))
    :config
    (org-roam-setup))

  (rune/leader-keys
    "nc"  '(:ignore t :which-key "Org Roam")
    "ncl"  'org-roam-buffer-toggle
    "ncf" 'org-roam-node-find
    "nci" 'org-roam-node-insert)
#+end_src 

*** Org Agenda

**** Update Contents on Save 

#+begin_src emacs-lisp
  (use-package org-make-toc
    :straight t
    :hook (org-mode . org-make-toc-mode))
#+end_src
**** Rainbow Delimiters
#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :straight t
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package rainbow-mode
    :defer t
    :hook (org-mode
           emacs-lisp-mode
           web-mode
           typescript-mode
           js2-mode))
#+end_src
*** Pomodoro 
:LOGBOOK:
CLOCK: [2022-06-26 Sun 16:05]--[2022-06-26 Sun 16:30] =>  0:25
:END:
#+begin_src emacs-lisp
  (use-package org-pomodoro
    :straight t
    :after org
    :config
    (setq org-pomodoro-start-sound "~/.dotfiles/.config/emacs/sounds/focus_bell.wav")
    (setq org-pomodoro-short-break-sound "~/.dotfiles/.config/emacs/sounds/three_beeps.wav")
    (setq org-pomodoro-long-break-sound "~/.dotfiles/.config/emacs/sounds/three_beeps.wav")
    (setq org-pomodoro-finished-sound "~/.dotfiles/.config/emacs/sounds/meditation_bell.wav")

    (rune/leader-keys
      "op"  '(org-pomodoro :which-key "pomodoro")))
#+end_src

** TODO Latex

Writing papers in Emacs has never been so fun
 
*** Balance window margins
#+begin_src emacs-lisp

  (use-package olivetti
    :straight t
    :diminish
    :hook (text-mode . olivetti-mode)
    :config
    (setq olivetti-body-width 100))

#+end_src
*** folding/unfolding like 0rg-mode
:LOGBOOK:
CLOCK: [2022-06-26 Sun 15:03]--[2022-06-26 Sun 15:03] =>  0:00
#+begin_src emacs-lisp

  (use-package outshine
    :straight nil
    :config
    (setq LaTeX-section-list '(
                               ("part" 0)
                               ("chapter" 1)
                               ("section" 2)
                               ("subsection" 3)
                               ("subsubsection" 4)
                               ("paragraph" 5)
                               ("subparagraph" 6)
                               ("begin" 7)
                               )
          )
    (add-hook 'LaTeX-mode-hook #'(lambda ()
                                   (outshine-mode 1)
                                   (setq outline-level #'LaTeX-outline-level)
                                   (setq outline-regexp (LaTeX-outline-regexp t))
                                   (setq outline-heading-alist
                                         (mapcar (lambda (x)
                                                   (cons (concat "\\" (nth 0 x)) (nth 1 x)))
                                                 LaTeX-section-list))))

    )

  (general-define-key
   :states '(normal visual)
   :keymaps 'LaTeX-mode-map
   "TAB"  '(outshine-cycle :which-key "outshine-cycle")
   )
#+end_src
