.config/emacs/config.org
*** Auctex
#+begin_src emacs-lisp
  ;; latexmk
  (straight-use-package
   '(auctex-latexmk :type git :host github :repo "tom-tan/auctex-latexmk"))
  ;; company
  (use-package company-math :straight t)
  (use-package company-auctex :straight t)
  (use-package company-reftex :straight t)


  ;;  use cdlatex
  (use-package cdlatex :straight t)

  ;; https://gist.github.com/saevarb/367d3266b3f302ecc896
  ;; https://piotr.is/2010/emacs-as-the-ultimate-latex-editor/

  (use-package auctex
    :defer t
    :custom
    (olivetti-body-width 100)
    (cdlatex-simplify-sub-super-scripts nil)
    :bind (:map LaTeX-mode-map
                ("C-c C-e" . cdlatex-environment)
                )
    :hook
    (LaTeX-mode . olivetti-mode)
    (LaTeX-mode . TeX-PDF-mode)
    (LaTeX-mode . company-mode)
    (LaTeX-mode . flyspell-mode)
    (LaTeX-mode . flycheck-mode)
    (LaTeX-mode . LaTeX-math-mode)
    (LaTeX-mode . turn-on-reftex)
    (LaTeX-mode . TeX-source-correlate-mode)
    (LaTeX-mode . try/latex-mode-setup)
    (LaTeX-mode . turn-on-cdlatex)

    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)
    (setq TeX-save-query nil)

    (setq reftex-plug-into-AUCTeX t)

    ;; pdftools
    ;; https://emacs.stackexchange.com/questions/21755/use-pdfview-as-default-auctex-pdf-viewer#21764
    (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
          TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
          TeX-source-correlate-start-server t) ;; not sure if last line is neccessary
    ;; to have the buffer refresh after compilation,
    ;; very important so that PDFView refesh itself after comilation
    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer)

    ;; latexmk
    (require 'auctex-latexmk)
    (auctex-latexmk-setup)
    (setq auctex-latexmk-inherit-TeX-PDF-mode t)
    )
#+end_src

** Ledger 
Be audit you can be
#+begin_src emacs-lisp
  (use-package ledger-mode
    :straight nil)
#+end_src

** Emacs-Haskell
#+begin_src emacs-lisp
  (use-package haskell-mode)
#+end_src

* Emacs

** Dired
#+begin_src emacs-lisp
  (use-package dired
    :straight nil)
#+end_src

*** File Icons
#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :straight nil
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)
#+end_src


*** Hide Dotfiles
#+begin_src emacs-lisp
;(use-package dired-hide-dotfiles
;  :hook (dired-mode . dired-hide-dotfiles-mode)
;  :config
;  (evil-collection-define-key 'normal 'dired-mode-map
;    "H" 'dired-hide-dotfiles-mode))
#+end_src
** Clean folders 
#+begin_src emacs-lisp

  ;; NOTE: If you want to move everything out of the ~/.config/emacs folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
					  ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering
    :straight nil )

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
	`((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

** Emacs client

#+begin_src emacs-lisp
(server-start)
#+end_src

** Info
* Term

**  eshell

the elisp shell that works everywhere


#+begin_src emacs-lisp
  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell))

  (use-package eshell-git-prompt
    :straight t
    :config
    (eshell-git-prompt-use-theme 'robbyrussell))
#+end_src
** vterm

The best terminal emulation in Emacs
 
#+begin_src emacs-lisp
  (use-package vterm
    :straight nil
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))

  (use-package rustic
    :straight t)
#+end_src

* Tools

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :straight t
    :diminish projectile-mode
    :config (projectile-mode)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))
#+end_src

** Counsel Projectile

#+begin_src emacs-lisp
  (use-package counsel-projectile
    :straight t
    :after projectile
    :config
    (counsel-projectile-mode 1))
#+end_src
** Magit

a git porcelain for Emacs

#+begin_src emacs-lisp
  (use-package magit
    :straight nil
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** TODO LSP

 M-x vscode
 
#+begin_src emacs-lisp

  (use-package lsp-mode
    :straight t
    :commands (lsp lsp-deferred)
    :hook 
    (lsp-mode . lsp-enable-which-key-integration)
    :custom
    (lsp-diagnostics-provider :capf)
    (lsp-headerline-breadcrumb-enable t)
    (lsp-headerline-breadcrumb-segments '(project file symbols))
    (lsp-lens-enable nil)
    (lsp-disabled-clients '((python-mode . pyls)))
    :init
    (setq lsp-keymap-prefix "C-c l") ;; Or 'C-l', 's-l'
    :config
    )
  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :after lsp-mode
    :custom
    (lsp-ui-doc-show-with-cursor nil)
    :config
    (setq lsp-ui-doc-position 'bottom)
    )


  (general-define-key
   :states '(normal visual)
   :keymaps 'lsp-mode-map
   :prefix "SPC"
    "d" '(lsp-find-definition :which-key "find-definitions")
    "r" '(lsp-find-references :which-key "find-references")
    "h" '(lsp-describe-thing-at-point :which-key "help-detailed")
    "e" '(lsp-ui-flycheck-list :which-key "flycheck-list")
    "o" 'counsel-imenu
    "x" 'lsp-execute-code-action)
#+end_src
- [ ] Finish setting up autocomplete, linter, and lsp for python mode, C, and Go
#+begin_src emacs-lisp

#+end_src

** PDF

PDF enhancements. 

#+begin_src emacs-lisp
  (use-package pdf-tools
    :straight nil
    :magic ("%PDF" . pdf-view-mode)
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-page))

#+end_src

*** GUIX packages

#+begin_src scheme
emacs-pdf-tools
#+end_src

** Epub 

#+begin_src emacs-lisp
  (use-package epub
    :load-path "~/.guix-profile/share/emacs/site-lisp/nov-el-0.3.4"
    :straight nil)
#+end_src
** Web
#+begin_src emacs-lisp
  (use-package simple-httpd
    :straight t)

  (use-package htmlize
    :straight t)
#+end_src
** Pass
#+begin_src emacs-lisp

  (use-package password-store
    :straight t
    :config
    (setq password-store-password-length 12))

  (use-package auth-source-pass
    :straight t
    :config
    (auth-source-pass-enable))

  (rune/leader-keys
    "ap" '(:ignore t :which-key "pass")
    "app" 'password-store-copy
    "api" 'password-store-insert)
#+end_src

* app

** Elfeed

*** Elfeed Tube

#+begin_src emacs-lisp
  (use-package elfeed-tube
    :straight (:host github :repo "karthink/elfeed-tube")
    :after elfeed
    :demand t
    :config
    ;; (setq elfeed-tube-auto-save-p nil) ;; t is auto-save (not default)
    ;; (setq elfeed-tube-auto-fetch-p t) ;;  t is auto-fetch (default)
    (elfeed-tube-setup)

    :bind (:map elfeed-show-mode-map
                ("F" . elfeed-tube-fetch)
                ([remap save-buffer] . elfeed-tube-save)
                :map elfeed-search-mode-map
                ("F" . elfeed-tube-fetch)
                ([remap save-buffer] . elfeed-tube-save)))

  (use-package elfeed-tube-mpv
    :straight (:host github :repo "karthink/elfeed-tube")
    :bind (:map elfeed-show-mode-map
                ("C-c C-f" . elfeed-tube-mpv-follow-mode)
                ("C-c C-w" . elfeed-tube-mpv-where)))
#+end_src

