.config/emacs/config.org
*** Elfeed RSS

Emacs as an RSS reader

#+begin_src emacs-lisp

  (use-package elfeed
    :straight nil
    :commands elfeed
    :config
    (setq elfeed-feeds
          '("https://nullprogram.com/feed/"
            "https://ambrevar.xyz/atom.xml"
            "https://guix.gnu.org/feeds/blog.atom"
            "https://xkcd.com/atom.xml"
            "https://valdyas.org/fading/feed/"
            "https://www.reddit.com/r/emacs/.rss")))
#+end_src

**** guix packages

#+begin_src scheme
"emacs-elfeed"
#+end_src


** Twittering Mode
  
#+begin_src emacs-lisp
  
  (use-package shrface
  :straight t
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t))
  (use-package twittering-mode
    :straight t
    :custom
    (setq twittering-use-master-password t)
    (setq twittering-allow-insecure-server-cert t)
    :config
    (require 'shrface)
    ) 
#+end_src

** Discord
#+begin_src emacs-lisp
(use-package elcord
  :straight t
  :custom
  (elcord-display-buffer-details nil)
  :config
  (elcord-mode))
#+end_src

** Leetcode
#+begin_src emacs-lisp
  (use-package leetcode
    :straight t
    :config
    (setq leetcode-save-solutions t)
    (setq leetcode-directory "~/leetcode")
    (setq leetcode-prefer-language "python3")
    )

#+end_src
This app uses ctable
#+begin_src emacs-lisp
  (use-package ctable
    :straight nil)
#+end_src

* Tramp

#+begin_src emacs-lisp
  ;; Set default connection mode to SSH
  (setq tramp-default-method "ssh")
  (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
#+end_src

* Spellcheck

** Grammar

 tasing grammar mistake every you make

#+begin_src emacs-lisp
  (use-package writegood-mode
    :config 
    (global-set-key "\C-cg" 'writegood-mode))
#+end_src


** Spelling

Tasing you for misspelling mispelling

#+begin_src emacs-lisp
  (use-package flyspell-correct
    :after flyspell
    :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))
#+end_src 







