.config/emacs/init.el
  :commands elfeed
  :config
  (setq elfeed-feeds
        '("https://nullprogram.com/feed/"
          "https://ambrevar.xyz/atom.xml"
          "https://guix.gnu.org/feeds/blog.atom"
          "https://xkcd.com/atom.xml"
          "https://valdyas.org/fading/feed/"
          "https://www.reddit.com/r/emacs/.rss")))

(use-package shrface
:straight t
:config
(shrface-basic)
(shrface-trial)
(shrface-default-keybindings) ; setup default keybindings
(setq shrface-href-versatile t))
(use-package twittering-mode
  :straight t
  :custom
  (setq twittering-use-master-password t)
  (setq twittering-allow-insecure-server-cert t)
  :config
  (require 'shrface)
  )

(use-package elcord
  :straight t
  :custom
  (elcord-display-buffer-details nil)
  :config
  (elcord-mode))

(use-package leetcode
  :straight t
  :config
  (setq leetcode-save-solutions t)
  (setq leetcode-directory "~/leetcode")
  (setq leetcode-prefer-language "python3")
  )

(use-package ctable
  :straight nil)

;; Set default connection mode to SSH
(setq tramp-default-method "ssh")
(add-to-list 'tramp-remote-path 'tramp-own-remote-path)

(use-package writegood-mode
  :config 
  (global-set-key "\C-cg" 'writegood-mode))

(use-package flyspell-correct
  :after flyspell
  :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))
